
## :white_check_mark: Apply Succeeded (koyashi.ro)

[CI link](https://github.com/koyashiro/infra/actions/runs/8789590354)



<pre><code>Apply complete! Resources: 3 added, 0 changed, 1 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
cloudflare_record.txt_discord: Refreshing state... [id=14eb5ef06ac31307e081d3f550804167]
cloudflare_record.mx_primary: Refreshing state... [id=255d37959633b15298e109355c0ea57b]
cloudflare_record.txt_keybase_site_verification: Refreshing state... [id=9511901ba761348897d7e8cf1a45228c]
cloudflare_record.cname_cdn: Refreshing state... [id=c4ed764d9bb89337db0ba36849d212bf]
cloudflare_record.mx_alt3: Refreshing state... [id=1688eab5753830f72c89aa00be2eaf80]
cloudflare_record.cname_root: Refreshing state... [id=a536905611e54f3561a1a4803c47ec30]
cloudflare_record.txt_spf: Refreshing state... [id=fb4fafabb68d9df8c88c66ef5de27dca]
cloudflare_record.cname_blog: Refreshing state... [id=dea0937bfa348d1be822f9566bc48e5e]
cloudflare_record.txt_google_domainkey: Refreshing state... [id=eff8125b84f9c478353500ce66c27e9c]
cloudflare_record.mx_alt2: Refreshing state... [id=445e5385cf8b0df3539bb30ec02bdbe0]
cloudflare_record.mx_alt4: Refreshing state... [id=440de8265d7b3c0bdb0cb96e371f900c]
cloudflare_record.txt_google_suite_verification: Refreshing state... [id=915ad97f62a8586238c3c2d7511973f9]
cloudflare_record.mx_alt1: Refreshing state... [id=212467857bb840bd60a9046d9ed37300]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # cloudflare_record.txt_dkim will be created
  + resource "cloudflare_record" "txt_dkim" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "*._domainkey"
      + proxiable       = (known after apply)
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=DKIM1; p="
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.txt_dmarc will be created
  + resource "cloudflare_record" "txt_dmarc" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_dmarc"
      + proxiable       = (known after apply)
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=DMARC1; p=reject; sp=reject; adkim=s; aspf=s;"
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.txt_google_dkim will be created
  + resource "cloudflare_record" "txt_google_dkim" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "google._domainkey"
      + proxiable       = (known after apply)
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=DKIM1; k=rsa; p=MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAsN9es+6C1V6MGC8Scg/nHQOEd9rtNraw6hqX6gi24F3i8hAVtlDC2FrSukqUz8HH1WEdaGxPir2yvE8xD7OxIT4uOUinb7eXY5CaCRJL9lpjj82FBcVOkiXcuTEFHu04kkHSo3fuLCl8OHrTup8HUqPJ2VwUiCeOkqjoy7Hv9VZDQmwjPbRyVncjVb/sDtVeY2bVUix1acSo/g5mIrbcw2xWrxCU/VWcEfOvQypfE+z9UfBpbeAGWArBD+l3+vLAWFb3dsMc4CvRa3mGY8kehOMTHnaaf2gO5k7afAkSil/zK580WLHG0Hq6rEG9tsawydVbrkCqRRsV9yAWhyI02QIDAQAB"
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.txt_google_domainkey will be destroyed
  # (because cloudflare_record.txt_google_domainkey is not in configuration)
  - resource "cloudflare_record" "txt_google_domainkey" {
      - allow_overwrite = false -> null
      - created_on      = "2024-04-17T17:09:50.412254Z" -> null
      - hostname        = "google._domainkey.koyashi.ro" -> null
      - id              = "eff8125b84f9c478353500ce66c27e9c" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
        } -> null
      - modified_on     = "2024-04-17T17:09:50.412254Z" -> null
      - name            = "google._domainkey" -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "TXT" -> null
      - value           = "v=DKIM1; k=rsa; p=MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAsN9es+6C1V6MGC8Scg/nHQOEd9rtNraw6hqX6gi24F3i8hAVtlDC2FrSukqUz8HH1WEdaGxPir2yvE8xD7OxIT4uOUinb7eXY5CaCRJL9lpjj82FBcVOkiXcuTEFHu04kkHSo3fuLCl8OHrTup8HUqPJ2VwUiCeOkqjoy7Hv9VZDQmwjPbRyVncjVb/sDtVeY2bVUix1acSo/g5mIrbcw2xWrxCU/VWcEfOvQypfE+z9UfBpbeAGWArBD+l3+vLAWFb3dsMc4CvRa3mGY8kehOMTHnaaf2gO5k7afAkSil/zK580WLHG0Hq6rEG9tsawydVbrkCqRRsV9yAWhyI02QIDAQAB" -> null
      - zone_id         = (sensitive value) -> null
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 0 to change, 1 to destroy.
cloudflare_record.txt_google_domainkey: Destroying... [id=eff8125b84f9c478353500ce66c27e9c]
cloudflare_record.txt_dmarc: Creating...
cloudflare_record.txt_dkim: Creating...
cloudflare_record.txt_google_dkim: Creating...
cloudflare_record.txt_google_domainkey: Destruction complete after 0s
cloudflare_record.txt_google_dkim: Creation complete after 1s [id=c64c7ba6dbb9f514c02765899360f076]
cloudflare_record.txt_dkim: Creation complete after 1s [id=d88e55e30d6f87388c78ed7878bf4f1b]
cloudflare_record.txt_dmarc: Creation complete after 1s [id=5ca18499ecf6c189979f78741466b48c]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 3 added, 0 changed, 1 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform-apply","PRNumber":171,"Program":"tfcmt","SHA1":"b0251566921526205147d517ca4e3cee89b474ee","Target":"koyashi.ro","Vars":{},"WorkflowName":"terraform"} -->